# CanSaveOrientation Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
View3D..::..CanSaveOrientation Method
View3D Class See Also
---
Returns true if the View3D's orientation can be saved, false otherwise.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public bool CanSaveOrientation()
```

Visual Basic
---
```text
Public Function CanSaveOrientation As Boolean
```

Visual C++
---
```text
public:
bool CanSaveOrientation()
```

# ### Return Value
True if the View3D's orientation can be saved, false otherwise.
# Remarks
The saved orientation of the default 3D view cannot be overwritten. To convert the default 3D view into a normal 3D view, rename the default 3D view.
# See Also
View3D Class
Autodesk.Revit.DB Namespace